In [1]:
import numpy as np
import pandas as pd
ironman_ser = pd.Series(np.random.randint(10, size=6))
print(ironman_ser)
print('陣列中的總和--------------->',ironman_ser.sum())
print('陣列中的平均值------------->',ironman_ser.mean())
print('陣列中middle two的平均值--->',ironman_ser.median())
print('陣列中最小值--------------->',ironman_ser.min())
print('陣列中最大值--------------->',ironman_ser.max())

0    9
1    5
2    9
3    5
4    9
5    9
dtype: int32
陣列中的總和---------------> 46
陣列中的平均值-------------> 7.666666666666667
陣列中middle two的平均值---> 9.0
陣列中最小值---------------> 5
陣列中最大值---------------> 9

In [3]:
ironman_df = pd.DataFrame({'A':np.random.randint(10, size=6), 'B':np.random.randint(10, size=6)})
print(ironman_df)
ironman_df.sum()

   A  B
0  0  6
1  3  3
2  4  4
3  3  4
4  5  8
5  1  5

A    16
B    30
dtype: int64

In [13]:
ironman_df.sum(axis='columns')

0     2
1     4
2    12
3    13
4     5
5     9
dtype: int64

In [4]:
ironman_df = pd.DataFrame({'team':['A','B','C','C','B','B'],'number':np.random.randint(10, size=6)}, columns=['team','number'])
print(ironman_df)
ironman_df.groupby('team').sum()

  team  number
0    A       9
1    B       6
2    C       9
3    C       4
4    B       2
5    B       9

      number
team
A          9
B         17
C         13

In [5]:
ironman_df.groupby('team').aggregate(['sum','max','min'])

     number
        sum max min
team
A         9   9   9
B        17   9   2
C        13   9   4

In [6]:
def filter_func(x):
    return x['number'].sum() > 10
ironman_df.groupby('team').filter(filter_func)

  team  number
1    B       6
2    C       9
3    C       4
4    B       2
5    B       9

In [9]:
ironman_df.groupby('team').transform(lambda x: x- x.sum())

   number
0       0
1     -11
2      -4
3      -9
4     -15
5      -8

In [19]:
def apply_func(x):
    x['number'] = x['number'] - x['number'].sum()
    return x
ironman_df.groupby('team').apply(apply_func)

  team  number
0    A       0
1    B     -11
2    C      -4
3    C      -9
4    B     -15
5    B      -8

In [2]:
ironman_df = pd.DataFrame({'team':['A','B','C','C','B','B'],'number':[9,6,9,4,2,9]}, columns=['team','number'])
newList = [0,1,1,2,0,2]
ironman_df.groupby(newList).sum()

   number
0      11
1      15
2      13

In [6]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [8]:
ironman = pd.Series(['Elephant','Lion','Lamigo','Guardian'])
ironman.str.lower()

0    elephant
1        lion
2      lamigo
3    guardian
dtype: object

In [19]:
ironman.str.extract('([ELa-z]+)')

          0
0  Elephant
1      Lion
2    Lamigo
3   uardian

In [20]:
ironman.str.slice(0,3)

0    Ele
1    Lio
2    Lam
3    Gua
dtype: object